# Enable verbose mode
ARGV << '-v'

cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'instrumenta/instrumenta'

cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'keybase'
cask 'zoomus'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
cask 'brackets'
cask 'grammarly' do
  version :latest
  sha256 :no_check

  url 'https://download-editor.grammarly.com/osx/Grammarly.dmg'
  name 'Grammarly'
  homepage 'https://www.grammarly.com/'

  app 'Grammarly.app'
end

brew 'wget'
brew 'ack'
brew 'dark-mode'
brew 'git'
brew 'git-lfs'
brew 'zsh'
brew 'go'
brew 'jq'
brew 'vim'
brew 'tig'
brew 'tmux'
brew 'terraform'
brew 'kubernetes-helm'
brew 'kubernetes-cli'
brew 'zsh'
brew 'zsh-completions'
brew 'hub'
brew 'kubeval'
brew 'kustomize'
brew 'tfenv'
brew 'tree'
brew 'watch'
brew 'docker'
brew 'docker-machine'
